[
{"company_name": "Tcs", "ratings": 3.8, "nob": "Service", "toc": "Indian Mnc", "ceo": "K. Krithivasan", "ownership": "Public", "headquarters": "Mumbai, Maharashtra, India", "founded_in": "1968", "ccn": "67789393", "description": "Tata Consultancy Services is an IT services, consulting and business solutions organization that has been partnering with many of the world’s largest businesses for the past 50 years. We believe innovation and collective knowledge can transform all our futures with greater purpose."},
{"company_name": "Wipro", "ratings": 3.8, "nob": "Service", "toc": "Indian Mnc", "ceo": "Anis Chenchah", "ownership": "Public", "headquarters": "Bangalore/Bengaluru, Karnataka, India", "founded_in": "1945", "ccn": "8028440011", "description": "Wipro Limited (NYSE: WIT, BSE: 507685, NSE: WIPRO) is a leading technology services and consulting company focused on building innovative solutions that address clients’ most complex digital transformation needs."},
{"company_name": "Accenture", "ratings": 4.0, "nob": "Service", "toc": "Foreign Mnc", "ceo": "Julie Sweet", "ownership": "Public", "headquarters": "Dublin, Ireland", "founded_in": "1989", "ccn": null, "description": "Accenture is a global professional services company with leading capabilities in digital, cloud, and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology, and Operations services — all powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. \n\nOur 674,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners, and communities. Visit us at accenture.com."},
{"company_name": "Cognizant", "ratings": 3.9, "nob": "Product", "toc": "Foreign Mnc", "ceo": "Ravi Kumar S", "ownership": "Private", "headquarters": null, "founded_in": "1994", "ccn": null, "description": "At Cognizant, we give organizations the insights to anticipate what customers want and act instantly to deliver on those demands. So they can achieve the goal of every modern business: staying one step ahead of a fast-changing world."},
{"company_name": "Hdfc Bank", "ratings": 4.0, "nob": "B2C", "toc": "Corporate", "ceo": "Sashidhar Jagdishan", "ownership": "Public", "headquarters": "Mumbai, Maharashtra, India", "founded_in": "1994", "ccn": null, "description": "The Housing Development Finance Corporation Limited or HDFC was among the first financial institutions in India to receive an “in principle” approval from the Reserve Bank of India (RBI) to set up a bank in the private sector. This was done as part of RBI’s policy for the liberalization of the Indian banking industry in 1994. HDFC Bank was incorporated in August 1994 in the name of HDFC Bank Limited, with its registered office in Mumbai, India. The bank commenced operations as a Scheduled Commercial Bank in January 1995. As of March 31, 2021, the Bank had a nationwide distribution network of 5,608 branches and 16,087 ATMs in 2,902 cities/towns."},
{"company_name": "Capgemini", "ratings": 3.8, "nob": "Service", "toc": "Foreign Mnc", "ceo": "Ashwin Yardi", "ownership": "Public", "headquarters": null, "founded_in": "1967", "ccn": null, "description": "Capgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2023 global revenues of €22.5 billion. Capgemini in India comprises nearly 175,000 team members working across 13 locations: Bangalore, Bhubaneswar, Chennai, Coimbatore, Gandhinagar, Gurugram, Hyderabad, Kolkata, Mumbai, Noida, Pune, Salem and Tiruchirappalli."},
{"company_name": "Hcltech", "ratings": 3.7, "nob": "B2B", "toc": "Indian Mnc", "ceo": "C Vijayakumar", "ownership": "Public", "headquarters": "Noida, Uttar Pradesh,", "founded_in": "1991", "ccn": null, "description": "is a global technology company, home to 227,481+ people across 60 countries, delivering industry-leading capabilities centered around digital, engineering, cloud and AI powered by a broad portfolio of technology services and products. We work with clients across all major verticals, providing industry solutions for Financial Services, Manufacturing, Life Sciences and Healthcare, Technology and Services, Telecom and Media, Retail and CPG, and Public Services."},
{"company_name": "Infosys", "ratings": 3.8, "nob": "Service", "toc": "Indian Mnc", "ceo": "Salil Parekh", "ownership": "Public", "headquarters": "Bengaluru/Bangalore, Karnataka, India", "founded_in": "1981", "ccn": null, "description": "Infosys is a global leader in next-generation digital services and consulting. Over 300,000 of our people work to amplify human potential and create the next opportunity for people, businesses, and communities."},
{"company_name": "Larsen & Toubro Limited", "ratings": 4.1, "nob": "Service", "toc": "Indian Mnc", "ceo": null, "ownership": "Public", "headquarters": "Mumbai, Maharashtra, India", "founded_in": "1938", "ccn": null, "description": "Larsen & Toubro is an Indian multinational engaged in EPC Projects, Hi-Tech Manufacturing and Services. It operates in over 50 countries worldwide. A strong, customer-focused approach and the constant quest for top-class quality have enabled L&T to attain and sustain leadership in its major lines of business for over eight decades. We are engaged in core, high impact sectors of the economy and our integrated capabilities span the entire spectrum of ‘design to delivery’. Every aspect of L&T's businesses is characterised by professionalism and high standards of corporate governance. Sustainability is embedded into our long-term strategy for growth. The Company’s manufacturing footprint extends across eight countries in addition to India. L&T has several international offices and a supply chain that extends around the globe."},
{"company_name": "Icici Bank", "ratings": 4.0, "nob": "Product", "toc": "Indian Mnc", "ceo": "Sandeep Bakhshi", "ownership": "Public", "headquarters": "Mumbai, Maharashtra, India", "founded_in": "1994", "ccn": "18001080", "description": "The Bank continue to achieve profitable growth in its business, strengthen its franchise and invest in building capabilities for the future. The Bank continued to grow its core operating profit less provisions led by a 360º customer-centric approach and exploring opportunities across ecosystems and micromarkets, within the guardrails of compliance and risk management. The Bank’s efforts towards building a sustainable business continued to be anchored by the principles of 'Return of Capital', 'Fair to Customer, Fair to Bank' and 'One Bank, One Team, One ROE'."},
{"company_name": "Hdb Financial Services", "ratings": 4.0, "nob": "Service", "toc": "Corporate", "ceo": "Ramesh Ganesan", "ownership": "Private", "headquarters": "Ahmedabad, Gujrat, India", "founded_in": "2007", "ccn": null, "description": "HDB Financial Services (HDBFS) is a leading Non-Banking Financial Company (NBFC) that caters to the growing needs of an Aspirational India, serving both Individual & Business Clients. Incorporated in 2007, we are a well-established business with strong capitalization. HDBFS is accredited with CARE AAA & CRISIL AAA ratings for its long-term debt & Bank facilities and an A1+ rating for its short-term debt & commercial papers, making it a strong and reliable financial institution. HDBFS maintains a strong commitment to ethical conduct. Transparency is ingrained in the structure of our Code of Ethics and our compliance policies to ensure that the highest standards of professional conduct are consistently reinforced and embedded in every corner of the organisation."},
{"company_name": "Reliance Retail", "ratings": 4.0, "nob": "Service", "toc": "Corporate", "ceo": "Damodar Mall", "ownership": "Private", "headquarters": "Navi Mumbai, Maharashtra, India", "founded_in": "2006", "ccn": "18008910001", "description": "Reliance Retail is India's largest, fastest-growing, and most profitable retailer with a diversified Omni-channel presence via integrated store concepts, and digital and new commerce platforms. We provide consumers with an outstanding value proposition, superior quality products, and an unmatched shopping experience. Founded in 2006 with a view to revolutionizing retail in India, we have, over the years, developed and perfected our capabilities across people, processes, and technology to meet our end objectives of creating a win-win proposition for our stakeholders across the value chain viz. Customers, Manufacturers/Farmers, Merchants, and Brand Partners as well as enhancing financial income and job security for tens of millions of Indians. Today, Reliance Retail serves a loyal customer base of more than 193 million across the country, catering to daily and occasional needs across the major consumption baskets of Consumer Electronics, Fashion & Lifestyle, Grocery, Pharma, and Connectivity. We operate the largest store network in the country with 15,000+ stores, spread over 42 million square feet of retail space, and present across 7,000+ cities. Our Omni-enabled store networks and extensive portfolio of digital commerce platforms bolstered by a strong supply chain and technology infrastructure, and supported by a well-trained workforce enable us to provide customer service par excellence. We continue to build our capabilities through organic growth, acquisitions, partnerships, and strategic investments to strengthen our competencies and bolster our product offerings. Our strong own brand portfolio is complemented by an equally strong brand partner portfolio, as Reliance Retail continues to be the partner of choice for leading national and international brands. Reliance Retail’s New Commerce initiative designed to boost the digital ecosystem for millions of partner merchants and MSMEs has enabled lakhs of small merchants to connect with a huge consumer base and embodies our commitment to bettering lives and creating value for the entire ecosystem."},
{"company_name": "Ibm", "ratings": 4.1, "nob": "Service", "toc": "Foreign Mnc", "ceo": "Arvind Krishna", "ownership": "Public", "headquarters": null, "founded_in": "1911", "ccn": "18004264968", "description": null},
{"company_name": "Teleperformance", "ratings": 3.8, "nob": "B2C", "toc": "Corporate", "ceo": "Daniel Julien", "ownership": "Private", "headquarters": null, "founded_in": "1978", "ccn": null, "description": "Teleperformance is the leading global provider of outsourced Digital Integrated Business Services."},
{"company_name": "Amazon", "ratings": 4.1, "nob": "Product", "toc": "Foreign Mnc", "ceo": "Andy Jassy", "ownership": "Public", "headquarters": null, "founded_in": "1994", "ccn": "18882804331", "description": "From an online bookstore to one of the world’s largest e-commerce platforms, Amazon has emerged as the top player in the industry since its inception in 1994. Amazon has built an extensive online marketplace across continents, empowering its customers with a catalog encompassing products from A-Z. Amazon strives to be the world’s most customer-centric company, a purpose that has powered multiple breakthroughs in our delivery, supply chain, and customer support services. In the pursuit of operational efficiency, tech innovations have become the cornerstone of the organization. This has led to the pioneering of new services, most notably within the entertainment, publishing, finance, IT, cloud computing, AI, and Machine Learning industries."},
{"company_name": "Jio", "ratings": 4.0, "nob": "Product", "toc": "Corporate", "ceo": "Kiran Thomas", "ownership": "Public", "headquarters": "Navi Mumbai, Maharashtra, India", "founded_in": "2018", "ccn": null, "description": "Reliance Jio Infocomm Limited, a subsidiary of Jio Platforms Limited, has built a world-class all-IP data-strong future-proof network with 4G LTE technology. The network is 5G ready with no legacy infrastructure and an indigenous 5G stack. It is the only network conceived as a Mobile Video Network from the ground up. It is future-ready and can be easily upgraded to support even more data, as technologies advance on to 6G and beyond."},
{"company_name": "Concentrix Corporation", "ratings": 3.9, "nob": "Service", "toc": "Foreign Mnc", "ceo": "Chris Caldwell", "ownership": "Public", "headquarters": null, "founded_in": "1983", "ccn": null, "description": "Concentrix is a technology-enabled global business services company specializing in customer engagement and improving business performance. We partner with ambitious, progressive executives around the world to future-proof their business and stay ahead of the competition and customer expectations.It’s all about tapping into sentiment and building an emotional connection that keeps customers and staff fanatical about your brand. That’s where we come in—we create exceptional customer engagement, accelerate digital transformation, and deliver actionable CX insights."},
{"company_name": "Axis Bank", "ratings": 3.9, "nob": "B2C", "toc": "Indian Mnc", "ceo": "Amitabh Chaudhry", "ownership": "Public", "headquarters": "Mumbai, Maharashtra, India", "founded_in": "1993", "ccn": null, "description": "Axis Bank is the third largest private sector bank in India. The Bank offers the entire spectrum of financial services to customer segments covering Large and Mid-Corporates, MSME, Agriculture and Retail Businesses. The Bank has a large footprint of 4,050 domestic branches (including extension counters) with 11,801 ATMs & 4,917 cash recyclers spread across the country as on 31st March, 2019. The overseas operations of the Bank are spread over nine international offices with branches at Singapore, Hong Kong, Dubai (at the DIFC), Colombo and Shanghai; representative offices at Dhaka, Dubai, Abu Dhabi and an overseas subsidiary at London, UK. The international offices focus on corporate lending, trade finance, syndication, investment banking and liability businesses."},
{"company_name": "Genpact", "ratings": 3.9, "nob": "Service", "toc": "Corporate", "ceo": "Balkrishan \"Bk\" Kalra", "ownership": "Public", "headquarters": "New York, New York, United States (Usa)", "founded_in": "1997", "ccn": null, "description": "Genpact (NYSE: G) is a global professional services and solutions firm delivering outcomes that shape the future. Our 125,000+ people across 30+ countries are driven by our innate curiosity entrepreneurial agility, and desire to create lasting value for clients. Powered by our purpose – the relentless pursuit of a world that works better for people – we serve and transform leading enterprises, including the Fortune Global 500, with our deep business and industry knowledge, digital operations services, and expertise in data, technology, and AI."},
{"company_name": "Tech Mahindra", "ratings": 3.7, "nob": "Service", "toc": "Corporate", "ceo": "Cp Gurnani", "ownership": "Public", "headquarters": "Pune, Maharashtra, India", "founded_in": "1986", "ccn": "9560591402", "description": "Tech Mahindra offers innovative and customer-centric digital experiences, enabling enterprises, associates, and society to rise. We are a USD 5.1 billion organization with 141,100+ professionals across 90 countries helping 1123 global customers, including Fortune 500 companies. \n\nWe are focused on leveraging next-generation technologies including 5G, Blockchain, Cybersecurity, Artificial Intelligence, and more, to enable end-to-end digital transformation for global customers. Tech Mahindra is one of the fastest-growing brands and amongst the top 15 IT service providers globally. \n\nTech Mahindra has consistently emerged as a leader in sustainability and is recognized amongst the ‘2021 Global 100 Most sustainable corporations in the World’ by Corporate Knights. With the NXT.NOW™ framework, Tech Mahindra aims to enhance ‘Human Centric Experience’ for our ecosystem and drive collaborative disruption with synergies arising from a robust portfolio of companies. \n\nTech Mahindra aims at delivering tomorrow’s experiences today and believes that the ‘Future is Now.\n\nWe are part of the Mahindra Group, founded in 1945, one of the largest and most admired multinational federations of companies with 260,000 employees in over 100 countries. It enjoys a leadership position in farm equipment, utility vehicles, information technology, and financial services in India and is the world’s largest tractor company by volume. It has a strong presence in renewable energy, agriculture, logistics, hospitality, and real estate. \n\nThe Mahindra Group has a clear focus on leading ESG globally, enabling rural prosperity and enhancing urban living, with a goal to drive positive change in the lives of communities and stakeholders to enable them to rise."}
]